app/controllers/api/v1/queue_jobs_controller.rb

SELECT "queue_jobs".* FROM "queue_jobs"
---
  def index
    @jobs = QueueJob.all