app/jobs/create_movie_job.rb

INSERT INTO "queue_jobs" ("job_id", "status", "job_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["job_id", "3e574227-d488-4f1f-9bf1-1ac6e4464ed1"], ["status", "Waiting"], ["job_name", "Veeren"], ["created_at", "2021-11-10 06:03:46.808548"], ["updated_at", "2021-11-10 06:03:46.808548"]]
SELECT "queue_jobs".* FROM "queue_jobs" WHERE "queue_jobs"."job_id" = $1 LIMIT $2  [["job_id", "b9a6f0ef-6ca8-4ea3-97e3-98f6936b2040"], ["LIMIT", 1]]
---

  before_enqueue do |job|
    pt = @priority == 1 ? "High" : @priority == 75 ? "Low" : @priority==11 ? "Default" : ""
    QueueJob.create(job_id: job_id, job_name: arguments.first[:title], status: "Waiting", priority: pt)

SELECT "queue_jobs".* FROM "queue_jobs" WHERE "queue_jobs"."job_id" = $1 LIMIT $2  [["job_id", "7428baf7-a65b-4efc-a7b4-a6d49845597e"], ["LIMIT", 1]]
UPDATE "queue_jobs" SET "status" = $1, "updated_at" = $2 WHERE "queue_jobs"."id" = $3  [["status", "done"], ["updated_at", "2021-11-09 10:54:17.034113"], ["id", 1]]
INSERT INTO "movies" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Veeren"], ["created_at", "2021-11-10 06:45:50.889452"], ["updated_at", "2021-11-10 06:45:50.889452"]]
UPDATE "queue_jobs" SET "status" = $1, "updated_at" = $2 WHERE "queue_jobs"."id" = $3  [["status", "done"], ["updated_at", "2021-11-10 06:45:50.911371"], ["id", 22]]
UPDATE "queue_jobs" SET "status" = $1 WHERE "queue_jobs"."id" = $2  [["status", "in progress"], ["id", 1]]
---
  def perform(movie_data)
    qjob = QueueJob.find_by_job_id(job_id)
    qjob.update(status: "in progress")
    if Movie.create(movie_data)
      qjob.update(status: "done")
    else
      qjob.update(status: "failed")